var str, con, pow, dex, app, siz, inte, edu;
var san, lck, ide, kno, hp, mp;
var edu_p, int_p;
var skil_temp = [];
var skil_point = [];
var skil_name = [];
var pointing_cnt = [];	//ポイントを振った技能の保存
var skil = ['回避', 'キック', '組付き', 'こぶし', '頭突き', '投擲', 'マーシャルアーツ', 
	'拳銃', 'サブマシンガン', 'ショットガン', 'マシンガン', 'ライフル', 
	'応急手当', '鍵開け', '隠す', '隠れる', '聞き耳', '忍び歩き', '写真術',
	'精神分析', '追跡', '登攀', '図書館', '目星',
	'運転', '機械修理', '重機械操作', '乗馬', '水泳', '製作', 
	'操縦', '跳躍', '電気修理', 'ナビゲート', '変装', 
	'言いくるめ', '信用', '説得', '値切り', '母国語', 
	'医学', 'オカルト', '化学', '芸術', '経理', '考古学', 'コンピューター', 
	'心理学', '人類学', '生物学', '地質学', '電子工学', '天文学', '博物学', 
	'物理学', '法律', '薬学', '歴史', '他言語','拡張武器(初期値1)'];

var default_point = [0, 25, 25, 50, 10, 25, 1, 20, 15, 30, 15, 25, 30, 1, 15, 10, 25,
	10, 10, 1, 10, 40, 25, 25, 20 , 20, 1, 5, 25, 5, 1, 25, 10, 10, 1, 5, 15, 15, 5, 0,
	5, 5, 1, 5, 10, 1, 1, 5, 1, 1, 1, 1, 1, 10, 1, 5, 1, 20, 1, 1]	;

var k;
var k_cnt;